def find_all(a_str, sub):
    start = 0
    while True:
        start = a_str.find(sub, start)
        if start == -1: return
        yield start
        start += len(sub)

content = "ظظظ قَالَ الْإِمَامُ ع‏ قَالَ:$ اذْكُرُوا نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ $‏ أَنْ  بَعَثْتُ مُوسَى وَ هَارُونَ إِلَى أَسْلَافِكُمْ بِالنُّبُوَّةِ، فَهَدَيْنَاهُمْ‏ إِلَى نُبُوَّةِ مُحَمَّدٍ ص وَ وَصِيَّةِ [عَلِيٍ‏] وَ إِمَامَةِ عِتْرَتِهِ الطَّيِّبِينَ. وَ أَخَذْنَا عَلَيْكُمْ‏ بِذَلِكَ الْعُهُودِ- وَ الْمَوَاثِيقِ الَّتِي إِنْ وَفَيْتُمْ بِهَا كُنْتُمْ مُلُوكاً فِي جِنَانِهِ مُسْتَحِقِّينَ‏ لِكَرَامَاتِهِ وَ رِضْوَانِهِ .ظظظ ظظظ حضرت امام عسکری علیه السلام فرمودند: «یاد کنید نعمتی را که به شما دادم» ، به اینکه حضرت موسی و هارون (علیهما السلام) را برای پیشینیانتان به نبوت برانگیختم و ایشان را به نبوت حضرت محمّد (صلی اللّه علیه و آله) و وصایت علی (علیه السلام) و امامت عترت پاک حضرت هدایت کردم.و )در این مورد) از شما پیمان های محکم گرفتم که اگر به آن عهد و میثاق (پیشینیانتان) وفا کنید ، می شوید مالک بهشت و مستحق کرامت و رضوان خداوند در بهشتش خواهید شد ظظظ ظظظ وَ $ أَنِّي فَضَّلْتُكُمْ عَلَى الْعالَمِينَ $‏ هُنَاكَ، أَيْ فَعَلْتُهُ بِأَسْلَافِكُمْ،فَضَّلْتُهُمْ دِيناً وَ دُنْيَا: أَمَّا تَفْضِيلُهُمْ فِي الدِّينِ فَلِقَبُولِهِمْ نُبُوَّةَ مُحَمَّدٍ [وَ وَلَايَةِ عَلِيٍ‏] وَ آلِهِمَا الطَّيِّبِينَ.ظظظ ظظظ و « همانا من برتری دادم شما را بر جهانیان » اینجا (عالَمین) یعنی ، برتری دادم شما را به پیشینیانتان ، برتری دادم ایشان (پیشینیانتان) را در دین و دنیا. اما فضیلت ایشان در دین ، به قبول کردن نبوت حضرت محمّد (صلی اللّه علیه و اله) و ولایت علی (علیه السلام) و خاندان پاکشان است.ظظظ ظظظ وَ أَمَّا [تَفْضِيلُهُمْ‏] فِي الدُّنْيَا فَبِأَنْ ظَلَّلْتُ‏ عَلَيْهِمُ الْغَمَامَ، وَ أَنْزَلْتُ عَلَيْهِمُ الْمَنَّ وَ السَّلْوَى وَ سَقَيْتُهُمْ مِنْ حَجَرٍ مَاءً عَذْباً، وَ فَلَقْتُ لَهُمُ الْبَحْرَ، فَأَنْجَيْتُهُمْ- وَ أَغْرَقْتُ أَعْدَاءَهُمْ فِرْعَوْنَ وَ قَوْمَهُ،  وَ فَضَّلْتُهُمْ بِذَلِكَ [عَلَى‏] عَالَمِي زَمَانِهِمُ الَّذِينَ خَالَفُوا طَرَائِقَهُمْ، وَ حَادُوا عَنْ سَبِيلِهِمْ ظظظ ظظظ و اما فضیلت و برتری دادن ایشان در دنیا به این است که : ابر را سایبان برایشان قرار دادیم و مرغ و ترنجبین برایشان فرستادیم و از سنگ آب گوارا نوشاندیم به ایشان، و دریا را برایشان گشودیم و فرعون و قومش غرق شدند. به اینها برتری دادیم ایشان را به مردم زمان خودشان ، کسانی که مخالف طریق ایشان ( در پذیرش نبوت و ولایت ائمه اطهار علیهم السلام ) بودند و با راه خدا دشمنی می کردند ،( بر ایشان برتری دادیم ).ظظظ ظظظ ثُمَّ قَالَ اللَّهُ عَزَّ وَ جَلَّ [لَهُمْ‏]: فَإِذَا كُنْتُ [قَدْ] فَعَلْتُ هَذَا بِأَسْلَافِكُمْ فِي ذَلِكَ الزَّمَانِ لِقَبُولِهِمْ وَلَايَةَ مُحَمَّدٍ وَ آلِهِ، فَبِالْحَرِيِ‏ أَنْ أَزِيدَكُمْ فَضْلًا فِي هَذَا الزَّمَانِ- إِذَا أَنْتُمْ وَفَيْتُمْ بِمَا آخُذُ مِنَ الْعَهْدِ وَ الْمِيثَاقِ عَلَيْكُمْ‏.ظظظ ظظظ سپس خداوند عزّوجلّ به ایشان فرمود:پس هنگامی که این کار را با پیشینیانتان در آن زمان بخاطر قبول کردن ولایت حضرت محمّد و خاندانش علیهم السلام انجام دادم پس شایسته است که زیاد کنم فضل را بر شما در این زمان ،(اگر) هنگامی که به آنچه عهد "
"و میثاق من با شماست وفا کنید.ظظظ"
lang_splitter = 'ظظظ'

from fuzzywuzzy import fuzz

def extract_arabic_text(content, lang_splitter):
    len_splitter = len(lang_splitter)
    indices = list(find_all(content, lang_splitter))
    arabic_parts = [content[(indices[i] + len_splitter):indices[i + 1]] for i in range(len(indices)) if
                    i % 4 == 0 and i < len(indices) - 1]
    arabic_text = ''.join(arabic_parts)
    return arabic_text

def is_similar(expression, content, tolerance):
    similarity_score = fuzz.partial_ratio(expression.lower(), content.lower())
    return similarity_score >= tolerance * 100

def remove_arabic_characters(string):
    to_get_replaced_characters = 'يكآةيؤإأۀ'
    replacers = 'یکاهیوااه'

    saken_dar = 'بْنُ'
    saken = saken_dar[1]
    to_be_removed_characters = 'ءًٌٍَُِّ' + saken

    my_table = string.maketrans(to_get_replaced_characters, replacers, to_be_removed_characters)
    result = string.translate(my_table)
    return result

tolerance = 0.8  # Adjust tolerance level as needed, between 0 and 1
expression = 'انه دخل السوق'
c = ' و علیک بصلاه اللیل و کرر ذلک ثلاثا و قال ا لا ترون ان المصلین باللیل هم احسن الناس وجوها لانهم خلوا باللیل لله خلوا باللیل سبحانه فکساهم من نوره '
is_similar(remove_arabic_characters(expression), remove_arabic_characters(c), 0.7)
